src/ExchangePlans/СОД_Узлы/СОД_Узлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="b3faf631-ce22-48a7-a3f3-91d262422d2e">
  <name>СОД_Узлы</name>
  <attributes>
    <name>Узел</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколДоставкиОтправлений</name>
    <type>
      <types>EnumRef.СОД_ПротоколыДоставкиОтправлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСообщения</name>
    <type>
      <types>EnumRef.СОД_ФорматыСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияИсходящихОтправлений</name>
    <type>
      <types>EnumRef.СОД_ВерсияОтправления</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияВходящихОтправлений</name>
    <type>
      <types>EnumRef.СОД_ВерсияОтправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPБазаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPИмяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBБазаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBURIПространстваИменСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBИмяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBИмяТочкиПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬ_НоваяВерсия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AMQPСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPИсходящееВиртуальныйХост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPИсходящееИмяТочкиОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPИсходящееИмяОчередиТранспорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPИсходящееИмяОчередиТранспортПодтверждение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPИсходящееИмяОчередиТочкаАктуальности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPВходящееВиртуальныйХост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPВходящееИмяТочкиОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPВходящееИмяОчередиТранспорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPВходящееИмяОчередиТранспортПодтверждение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPВходящееИмяОчередиТочкаАктуальности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ExchangePlan>

src/ExchangePlans/СОД_Узлы/Forms/ФормаУзла/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// установка значений по умолчанию при создании узла
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда     
		
		Объект.HTTPИмяСервиса = "sed-web";
		
		Объект.WEBURIПространстваИменСервиса = "asrv.r5g.ru";
		Объект.WEBИмяСервиса = "SED_WEB";  
		Объект.WEBИмяТочкиПодключения = "SED_WEBSoap";
		
	КонецЕсли;
	
	ОбновитьПредставлениеHTTP();
	ОбновитьПредставлениеSOAP();
	
	УправлениеОтметкойНезаполненного(); 
	
	//Строка = СОД_СинхронизацияПовтИсп.ПолучитьИмяБазы(); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПротоколДоставкиОтправленийПриИзменении(Элемент)
	УправлениеОтметкойНезаполненного();
КонецПроцедуры

&НаКлиенте
Процедура HTTPСерверПриИзменении(Элемент)
	
	ОбновитьПредставлениеHTTP();
	
КонецПроцедуры

&НаКлиенте
Процедура HTTPПортПриИзменении(Элемент)
	
	ОбновитьПредставлениеHTTP();
	
КонецПроцедуры

&НаКлиенте
Процедура HTTPБазаДанныхПриИзменении(Элемент)
	
	ОбновитьПредставлениеHTTP();
	
КонецПроцедуры

&НаКлиенте
Процедура HTTPИмяСервисаПриИзменении(Элемент)
	
	ОбновитьПредставлениеHTTP();
	
КонецПроцедуры

&НаКлиенте
Процедура WEBСерверПриИзменении(Элемент)
	ОбновитьПредставлениеSOAP();
КонецПроцедуры

&НаКлиенте
Процедура WEBПортПриИзменении(Элемент)
	ОбновитьПредставлениеSOAP();
КонецПроцедуры

&НаКлиенте
Процедура WEBБазаДанныхПриИзменении(Элемент)
	ОбновитьПредставлениеSOAP();
КонецПроцедуры

&НаКлиенте
Процедура AMQPИсходящееВиртуальныйХостПриИзменении(Элемент)
	
	ОбновитьМаршрутыAMQP();
	
КонецПроцедуры

&НаКлиенте
Процедура AMQPВходящееВиртуальныйХостПриИзменении(Элемент)
	
	ОбновитьМаршрутыAMQP();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура AMPQПроверитьСоединение(Команда)
	AMPQПроверитьСоединениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура WEBПроверитьСоединение(Команда)
	WEBПроверитьСоединениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура HTTPПроверитьСоединение(Команда)
	HTTPПроверитьСоединениеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// КОМАНДЫ: СЕРВЕР

&НаСервере
Процедура AMPQПроверитьСоединениеНаСервере()
	
	Клиент = СОД_Синхронизация.ПолучитьAMQPКлиентHTTP(Объект, 5); 
	
	Если Клиент <> Неопределено Тогда
		СОД_Общий.СообщитьПользователю("Соединение успешно установленно !");
	КонецЕсли; 
		
	Клиент = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура WEBПроверитьСоединениеНаСервере()
	
	Если СОД_Синхронизация.ПолучитьWSПрокси(Объект) <> Неопределено Тогда
		СОД_Общий.СообщитьПользователю("Соединение успешно установленно !");
	Иначе
		СОД_Общий.СообщитьПользователю("Не удалось установить соединение !");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура HTTPПроверитьСоединениеНаСервере()
	
	Если СОД_Синхронизация.ВыполнитьHSЗапросRun(Объект) = "Успех" Тогда
		СОД_Общий.СообщитьПользователю("Соединение успешно установленно !");
	Иначе
		СОД_Общий.СообщитьПользователю("Не удалось установить соединение !");
	КонецЕсли;
	
КонецПроцедуры

// СЛУЖЕБНЫЕ: СЕРВЕР

&НаСервере
Процедура УправлениеОтметкойНезаполненного() 
	
	Если Объект.ПротоколДоставкиОтправлений = Перечисления.СОД_ПротоколыДоставкиОтправлений.HTTPСервис Тогда
		
		УстановитьОтметкаНезаполненного(ПланыОбмена.СОД_Узлы.ПолучитьОбязательныеРеквизитыHTTP(), Истина);
		УстановитьОтметкаНезаполненного(ПланыОбмена.СОД_Узлы.ПолучитьОбязательныеРеквизитыSOAP(), Ложь);
		
	ИначеЕсли Объект.ПротоколДоставкиОтправлений = Перечисления.СОД_ПротоколыДоставкиОтправлений.WEBСервис Тогда  
		
		УстановитьОтметкаНезаполненного(ПланыОбмена.СОД_Узлы.ПолучитьОбязательныеРеквизитыHTTP(), Ложь);
		УстановитьОтметкаНезаполненного(ПланыОбмена.СОД_Узлы.ПолучитьОбязательныеРеквизитыSOAP(), Истина);

	Иначе 
		
		УстановитьОтметкаНезаполненного(ПланыОбмена.СОД_Узлы.ПолучитьОбязательныеРеквизитыHTTP(), Ложь);
		УстановитьОтметкаНезаполненного(ПланыОбмена.СОД_Узлы.ПолучитьОбязательныеРеквизитыSOAP(), Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтметкаНезаполненного(МассивРеквизитов, Отметка)
	
	Для Каждого Имя Из МассивРеквизитов Цикл 
		Если Элементы.Найти(Имя) <> Неопределено Тогда 
			Элементы[Имя].ОтметкаНезаполненного = Отметка;
			Элементы[Имя].АвтоОтметкаНезаполненного = Отметка;
		КонецЕсли;	
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьМаршрутыAMQP()
	
	ИмяБазыВКластере = СОД_СинхронизацияПовтИсп.ПолучитьИмяБазы();

	Объект.AMQPИсходящееИмяТочкиОбмена = Объект.AMQPИсходящееВиртуальныйХост + "." + ИмяБазыВКластере; 
	
	Объект.AMQPИсходящееИмяОчередиТранспорт 				= "t." + Объект.Код;
	Объект.AMQPИсходящееИмяОчередиТранспортПодтверждение 	= "c." + Объект.Код;
	Объект.AMQPИсходящееИмяОчередиТочкаАктуальности 		= "a." + Объект.Код;  
	
	Объект.AMQPВходящееИмяТочкиОбмена = Объект.AMQPВходящееВиртуальныйХост + "." + Объект.Наименование;  
	
	Объект.AMQPВходящееИмяОчередиТранспорт					= "t." + Объект.Код;  
	Объект.AMQPВходящееИмяОчередиТранспортПодтверждение		= "c." + Объект.Код;
	Объект.AMQPВходящееИмяОчередиТочкаАктуальности			= "a." + Объект.Код;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеHTTP()
	
	HTTPСтрокаСоединения = ПланыОбмена.СОД_Узлы.ПолучитьПредставлениеHTTP(Объект);
	
КонецПроцедуры  

&НаСервере
Процедура ОбновитьПредставлениеSOAP()
	
	SOAPСтрокаСоединения = ПланыОбмена.СОД_Узлы.ПолучитьПредставлениеSOAP(Объект);
	
КонецПроцедуры

#КонецОбласти
